; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-4nodes-1000size-4degree-100mindistance-4trucks-5packages-954seed

(define (problem transport-three-cities-sequential-4nodes-1000size-4degree-100mindistance-4trucks-5packages-954seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 729,948 -> 554,920
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 18)
  ; 554,920 -> 729,948
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 18)
  ; 300,295 -> 554,920
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 68)
  ; 554,920 -> 300,295
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 68)
  ; 617,832 -> 554,920
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 11)
  ; 554,920 -> 617,832
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 11)
  ; 617,832 -> 729,948
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 17)
  ; 729,948 -> 617,832
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 17)
  ; 617,832 -> 300,295
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 63)
  ; 300,295 -> 617,832
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 63)
  ; 2018,367 -> 2587,708
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 67)
  ; 2587,708 -> 2018,367
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 67)
  ; 2524,155 -> 2587,708
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 56)
  ; 2587,708 -> 2524,155
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 56)
  ; 2524,155 -> 2018,367
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 55)
  ; 2018,367 -> 2524,155
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 55)
  ; 2064,777 -> 2587,708
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 53)
  ; 2587,708 -> 2064,777
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 53)
  ; 2064,777 -> 2018,367
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 42)
  ; 2018,367 -> 2064,777
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 42)
  ; 1286,2227 -> 1126,2209
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 17)
  ; 1126,2209 -> 1286,2227
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 17)
  ; 1286,2227 -> 1930,2359
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 66)
  ; 1930,2359 -> 1286,2227
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 66)
  ; 1588,2577 -> 1126,2209
  (road city-3-loc-4 city-3-loc-1)
  (= (road-length city-3-loc-4 city-3-loc-1) 60)
  ; 1126,2209 -> 1588,2577
  (road city-3-loc-1 city-3-loc-4)
  (= (road-length city-3-loc-1 city-3-loc-4) 60)
  ; 1588,2577 -> 1930,2359
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 41)
  ; 1930,2359 -> 1588,2577
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 41)
  ; 1588,2577 -> 1286,2227
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 47)
  ; 1286,2227 -> 1588,2577
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 47)
  ; 729,948 <-> 2064,777
  (road city-1-loc-2 city-2-loc-4)
  (= (road-length city-1-loc-2 city-2-loc-4) 135)
  (road city-2-loc-4 city-1-loc-2)
  (= (road-length city-2-loc-4 city-1-loc-2) 135)
  (road city-1-loc-2 city-3-loc-2)
  (= (road-length city-1-loc-2 city-3-loc-2) 142)
  (road city-3-loc-2 city-1-loc-2)
  (= (road-length city-3-loc-2 city-1-loc-2) 142)
  (road city-2-loc-3 city-3-loc-4)
  (= (road-length city-2-loc-3 city-3-loc-4) 183)
  (road city-3-loc-4 city-2-loc-3)
  (= (road-length city-3-loc-4 city-2-loc-3) 183)
  (at package-1 city-1-loc-3)
  (at package-2 city-1-loc-1)
  (at package-3 city-3-loc-3)
  (at package-4 city-2-loc-4)
  (at package-5 city-1-loc-3)
  (at truck-1 city-2-loc-4)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
  (at truck-3 city-1-loc-4)
  (capacity truck-3 capacity-3)
  (at truck-4 city-1-loc-3)
  (capacity truck-4 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-1-loc-4)
  (at package-3 city-1-loc-1)
  (at package-4 city-3-loc-3)
  (at package-5 city-3-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-4 city-1-loc-3 package-5 capacity-3 capacity-4)
   deleted: (at package-5 city-1-loc-3) (capacity truck-4 capacity-4)
   added: (in package-5 truck-4) (capacity truck-4 capacity-3)
   goals met: 0 of 5
2. (pick-up truck-4 city-1-loc-3 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-1-loc-3) (capacity truck-4 capacity-3)
   added: (in package-1 truck-4) (capacity truck-4 capacity-2)
   goals met: 0 of 5
3. (drive truck-4 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-4 city-1-loc-3)
   added: (at truck-4 city-1-loc-1)
   goals met: 0 of 5
4. (pick-up truck-4 city-1-loc-1 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-1) (capacity truck-4 capacity-2)
   added: (in package-2 truck-4) (capacity truck-4 capacity-1)
   goals met: 0 of 5
5. (drive truck-4 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-4 city-1-loc-1)
   added: (at truck-4 city-1-loc-2)
   goals met: 0 of 5
6. (drive truck-4 city-1-loc-2 city-2-loc-4)
   deleted: (at truck-4 city-1-loc-2)
   added: (at truck-4 city-2-loc-4)
   goals met: 0 of 5
7. (pick-up truck-4 city-2-loc-4 package-4 capacity-0 capacity-1)
   deleted: (at package-4 city-2-loc-4) (capacity truck-4 capacity-1)
   added: (in package-4 truck-4) (capacity truck-4 capacity-0)
   goals met: 0 of 5
8. (drive truck-4 city-2-loc-4 city-2-loc-1)
   deleted: (at truck-4 city-2-loc-4)
   added: (at truck-4 city-2-loc-1)
   goals met: 0 of 5
9. (drive truck-4 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-4 city-2-loc-1)
   added: (at truck-4 city-2-loc-3)
   goals met: 0 of 5
10. (drop truck-4 city-2-loc-3 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-4) (capacity truck-4 capacity-0)
   added: (at package-1 city-2-loc-3) (capacity truck-4 capacity-1)
   goals met: 1 of 5
11. (drive truck-4 city-2-loc-3 city-3-loc-4)
   deleted: (at truck-4 city-2-loc-3)
   added: (at truck-4 city-3-loc-4)
   goals met: 1 of 5
12. (drop truck-4 city-3-loc-4 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-4) (capacity truck-4 capacity-1)
   added: (at package-5 city-3-loc-4) (capacity truck-4 capacity-2)
   goals met: 2 of 5
13. (drive truck-4 city-3-loc-4 city-3-loc-3)
   deleted: (at truck-4 city-3-loc-4)
   added: (at truck-4 city-3-loc-3)
   goals met: 2 of 5
14. (drop truck-4 city-3-loc-3 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-4) (capacity truck-4 capacity-2)
   added: (at package-4 city-3-loc-3) (capacity truck-4 capacity-3)
   goals met: 3 of 5
15. (pick-up truck-4 city-3-loc-3 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-3-loc-3) (capacity truck-4 capacity-3)
   added: (in package-3 truck-4) (capacity truck-4 capacity-2)
   goals met: 3 of 5
16. (drive truck-4 city-3-loc-3 city-3-loc-2)
   deleted: (at truck-4 city-3-loc-3)
   added: (at truck-4 city-3-loc-2)
   goals met: 3 of 5
17. (drive truck-4 city-3-loc-2 city-1-loc-2)
   deleted: (at truck-4 city-3-loc-2)
   added: (at truck-4 city-1-loc-2)
   goals met: 3 of 5
18. (drive truck-4 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-4 city-1-loc-2)
   added: (at truck-4 city-1-loc-1)
   goals met: 3 of 5
19. (drop truck-4 city-1-loc-1 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-4) (capacity truck-4 capacity-2)
   added: (at package-3 city-1-loc-1) (capacity truck-4 capacity-3)
   goals met: 4 of 5
20. (drive truck-4 city-1-loc-1 city-1-loc-4)
   deleted: (at truck-4 city-1-loc-1)
   added: (at truck-4 city-1-loc-4)
   goals met: 4 of 5
21. (drop truck-4 city-1-loc-4 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-4) (capacity truck-4 capacity-3)
   added: (at package-2 city-1-loc-4) (capacity truck-4 capacity-4)
   goals met: 5 of 5
